-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost
-- 生成日時: 2020 年 7 月 02 日 16:33
-- サーバのバージョン： 10.4.13-MariaDB
-- PHP のバージョン: 7.4.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `gsacf_d06_21`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `BMI`
--

CREATE TABLE `BMI` (
  `id` int(11) NOT NULL,
  `name` varchar(128) NOT NULL,
  `u_id` varchar(60) NOT NULL,
  `u_pw` varchar(60) NOT NULL,
  `mail` varchar(60) NOT NULL,
  `sex` varchar(10) NOT NULL,
  `grade` varchar(30) NOT NULL,
  `height` varchar(30) NOT NULL,
  `weight` varchar(30) NOT NULL,
  `bmi` int(4) NOT NULL,
  `dt` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `BMI`
--

INSERT INTO `BMI` (`id`, `name`, `u_id`, `u_pw`, `mail`, `sex`, `grade`, `height`, `weight`, `bmi`, `dt`) VALUES
(1, '管理者', 'master', '0001', '', '00', '管理画面', 'ーー', 'ーー', 0, '0000-00-00 00:00:00'),
(2, 'テスト太郎', 'テスト太郎', '1111', '', 'men', '高校2年', '180', '68', 0, '2020-06-22 00:00:00'),
(3, '佐藤太郎', '', '', '', '', '中学1年生', '170', '65.2', 0, '2020-06-23 13:14:41'),
(4, 'shin', '', '', '', '', '高校1年生', '161', '60.3', 0, '2020-06-23 13:16:02'),
(5, 'ベジ子', 'ベジータ', '0002', '', '女性', '中学2年生', '160.0', '60.0', 0, '2020-06-25 14:39:26'),
(6, 'ベジ子', 'ベジータ', '0002', '', '女性', '中学2年生', '160.0', '60.0', 0, '2020-06-25 14:39:54'),
(7, 'ギニュー', 'ギニュー', 'gyunyu', '', '男性', '大学2年生', '190', '100', 0, '2020-06-25 14:52:11'),
(8, 'グルト', 'グルト', 'グルト', '', '女性', '大学1年生', '180.0', '80.0', 0, '2020-06-25 16:13:17'),
(9, '孫悟空', '悟空', 'ゴクウ', '', '男性', '一般の方', '181.0', '90.0', 0, '2020-06-25 21:18:53'),
(10, 'バータ', 'バータ', 'バタ', '', '男性', '高校2年生', '230.0', '160.0', 0, '2020-06-25 21:51:09'),
(11, 'バータ', 'バータ', 'バタ', '', '男性', '高校1年生', '160.0', '70.0', 0, '2020-06-26 10:08:25'),
(12, 'バータ', '', '', '', '', '', '230.0', '160.0', 0, '2020-06-29 16:30:18'),
(13, 'バータ', '', '', '', '', '', '230.0', '160.0', 0, '2020-06-29 16:33:18'),
(14, 'バータ', '', '', '', '', '', '230.0', '160.0', 0, '2020-06-29 16:33:34'),
(15, 'ベジ子', '', '', '', '', '', '160.0', '60.0', 0, '2020-06-29 16:34:45'),
(16, '初めて太郎', '初めて', '0000', '', '男性', '高校1年生', '170', '67', 0, '2020-07-02 12:18:26'),
(17, '初めて太郎', '初めて', '0000', 'ccc', '男性', '高校1年生', '170', '67', 0, '2020-07-02 12:39:01'),
(18, '初めて太郎', '初めて', '0000', 'ccc', '男性', '高校1年生', '170', '67', 0, '2020-07-02 12:39:13'),
(19, 'sakuragi', 'リバウンド王', '10', 'hana@dunk', '男性', '高校1年生', '188', '86', 0, '2020-07-02 12:52:56'),
(20, 'rukawa', '流川', '11', 'ruru@kawa', '男性', '高校1年生', '1.87', '78', 22, '2020-07-02 16:27:57'),
(21, 'rukawa', '流川', '11', 'ruru@kawa', '男性', '高校1年生', '1.87', '78', 22, '2020-07-02 20:38:49'),
(22, '佐藤太郎', '', '', '', '', '', '1.6', '60.0', 23, '2020-07-02 23:01:41'),
(23, '佐藤太郎', '', '', '', '', '', '1.6', '60.0', 23, '2020-07-02 23:03:46'),
(24, '佐藤太郎', '', '', '', '', '', '1.6', '60.0', 23, '2020-07-02 23:13:08');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `BMI`
--
ALTER TABLE `BMI`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルのAUTO_INCREMENT
--

--
-- テーブルのAUTO_INCREMENT `BMI`
--
ALTER TABLE `BMI`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
